findByggForMatrikkelenheter.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:dom="http://matrikkel.statkart.no/matrikkelapi/wsapi/v1/domain"
  xmlns:sto="http://matrikkel.statkart.no/matrikkelapi/wsapi/v1/service/bygning"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header/>
  <soapenv:Body>
    <sto:findByggForMatrikkelenheter>
      <sto:matrikkelenhetIdList>
        <dom:matrikkelenhet>
          <dom:item>510390946</dom:item>
        </dom:matrikkelenhet>
      </sto:matrikkelenhetIdList>
      <sto:matrikkelContext>
        <dom:locale>no_NO_B</dom:locale>
        <dom:brukOriginaleKoordinater>false</dom:brukOriginaleKoordinater>
        <dom:koordinatsystemKodeId>
          <dom:value>25833</dom:value>
        </dom:koordinatsystemKodeId>
        <dom:systemVersion>trunk</dom:systemVersion>
        <dom:klientIdentifikasjon>curl-prodtest</dom:klientIdentifikasjon>
        <dom:snapshotVersion>
          <dom:timestamp>9999-01-01T00:00:00+01:00</dom:timestamp>
        </dom:snapshotVersion>
      </sto:matrikkelContext>
    </sto:findByggForMatrikkelenheter>
  </soapenv:Body>
</soapenv:Envelope>
